; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image1 - mode
	infrared2 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	Star0 - direction
	Star3 - direction
	Planet4 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star1)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 165)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star0)
	(supports instrument4 image1)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 140)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 167)
	(supports instrument7 thermograph0)
	(supports instrument7 infrared2)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared2)
	(calibration_target instrument8 Star0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 114)
	(supports instrument9 infrared2)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star14)
	(= (data_capacity satellite4) 1000)
	(= (fuel satellite4) 191)
	(= (data Star3 image1) 37)
	(= (data Planet4 image1) 213)
	(= (data Planet5 image1) 245)
	(= (data Planet6 image1) 195)
	(= (data Planet7 image1) 180)
	(= (data Planet8 image1) 173)
	(= (data Planet9 image1) 117)
	(= (data Star10 image1) 152)
	(= (data Star11 image1) 80)
	(= (data Phenomenon12 image1) 287)
	(= (data Phenomenon13 image1) 78)
	(= (data Star14 image1) 204)
	(= (data Star3 infrared2) 43)
	(= (data Planet4 infrared2) 15)
	(= (data Planet5 infrared2) 183)
	(= (data Planet6 infrared2) 197)
	(= (data Planet7 infrared2) 283)
	(= (data Planet8 infrared2) 144)
	(= (data Planet9 infrared2) 240)
	(= (data Star10 infrared2) 256)
	(= (data Star11 infrared2) 219)
	(= (data Phenomenon12 infrared2) 237)
	(= (data Phenomenon13 infrared2) 139)
	(= (data Star14 infrared2) 171)
	(= (data Star3 thermograph0) 83)
	(= (data Planet4 thermograph0) 58)
	(= (data Planet5 thermograph0) 103)
	(= (data Planet6 thermograph0) 105)
	(= (data Planet7 thermograph0) 3)
	(= (data Planet8 thermograph0) 42)
	(= (data Planet9 thermograph0) 239)
	(= (data Star10 thermograph0) 79)
	(= (data Star11 thermograph0) 238)
	(= (data Phenomenon12 thermograph0) 153)
	(= (data Phenomenon13 thermograph0) 239)
	(= (data Star14 thermograph0) 285)
	(= (slew_time Star1 Star0) 51.32)
	(= (slew_time Star0 Star1) 51.32)
	(= (slew_time GroundStation2 Star0) 14.41)
	(= (slew_time Star0 GroundStation2) 14.41)
	(= (slew_time GroundStation2 Star1) 55.55)
	(= (slew_time Star1 GroundStation2) 55.55)
	(= (slew_time Star3 Star0) 39.63)
	(= (slew_time Star0 Star3) 39.63)
	(= (slew_time Star3 Star1) 44.8)
	(= (slew_time Star1 Star3) 44.8)
	(= (slew_time Star3 GroundStation2) 15.24)
	(= (slew_time GroundStation2 Star3) 15.24)
	(= (slew_time Planet4 Star0) 21.7)
	(= (slew_time Star0 Planet4) 21.7)
	(= (slew_time Planet4 Star1) 55.38)
	(= (slew_time Star1 Planet4) 55.38)
	(= (slew_time Planet4 GroundStation2) 27.07)
	(= (slew_time GroundStation2 Planet4) 27.07)
	(= (slew_time Planet4 Star3) 64.93)
	(= (slew_time Star3 Planet4) 64.93)
	(= (slew_time Planet5 Star0) 3.838)
	(= (slew_time Star0 Planet5) 3.838)
	(= (slew_time Planet5 Star1) 34.98)
	(= (slew_time Star1 Planet5) 34.98)
	(= (slew_time Planet5 GroundStation2) 37.6)
	(= (slew_time GroundStation2 Planet5) 37.6)
	(= (slew_time Planet5 Star3) 33.01)
	(= (slew_time Star3 Planet5) 33.01)
	(= (slew_time Planet5 Planet4) 70.74)
	(= (slew_time Planet4 Planet5) 70.74)
	(= (slew_time Planet6 Star0) 77.18)
	(= (slew_time Star0 Planet6) 77.18)
	(= (slew_time Planet6 Star1) 67)
	(= (slew_time Star1 Planet6) 67)
	(= (slew_time Planet6 GroundStation2) 46.79)
	(= (slew_time GroundStation2 Planet6) 46.79)
	(= (slew_time Planet6 Star3) 18.3)
	(= (slew_time Star3 Planet6) 18.3)
	(= (slew_time Planet6 Planet4) 3.588)
	(= (slew_time Planet4 Planet6) 3.588)
	(= (slew_time Planet6 Planet5) 14.99)
	(= (slew_time Planet5 Planet6) 14.99)
	(= (slew_time Planet7 Star0) 49.88)
	(= (slew_time Star0 Planet7) 49.88)
	(= (slew_time Planet7 Star1) 8.78)
	(= (slew_time Star1 Planet7) 8.78)
	(= (slew_time Planet7 GroundStation2) 40.52)
	(= (slew_time GroundStation2 Planet7) 40.52)
	(= (slew_time Planet7 Star3) 33.8)
	(= (slew_time Star3 Planet7) 33.8)
	(= (slew_time Planet7 Planet4) 2.847)
	(= (slew_time Planet4 Planet7) 2.847)
	(= (slew_time Planet7 Planet5) 49.65)
	(= (slew_time Planet5 Planet7) 49.65)
	(= (slew_time Planet7 Planet6) 9.406)
	(= (slew_time Planet6 Planet7) 9.406)
	(= (slew_time Planet8 Star0) 3.187)
	(= (slew_time Star0 Planet8) 3.187)
	(= (slew_time Planet8 Star1) 30.93)
	(= (slew_time Star1 Planet8) 30.93)
	(= (slew_time Planet8 GroundStation2) 15.71)
	(= (slew_time GroundStation2 Planet8) 15.71)
	(= (slew_time Planet8 Star3) 62.73)
	(= (slew_time Star3 Planet8) 62.73)
	(= (slew_time Planet8 Planet4) 14.16)
	(= (slew_time Planet4 Planet8) 14.16)
	(= (slew_time Planet8 Planet5) 64.31)
	(= (slew_time Planet5 Planet8) 64.31)
	(= (slew_time Planet8 Planet6) 22.81)
	(= (slew_time Planet6 Planet8) 22.81)
	(= (slew_time Planet8 Planet7) 22.49)
	(= (slew_time Planet7 Planet8) 22.49)
	(= (slew_time Planet9 Star0) 28.92)
	(= (slew_time Star0 Planet9) 28.92)
	(= (slew_time Planet9 Star1) 3.923)
	(= (slew_time Star1 Planet9) 3.923)
	(= (slew_time Planet9 GroundStation2) 37.34)
	(= (slew_time GroundStation2 Planet9) 37.34)
	(= (slew_time Planet9 Star3) 1.752)
	(= (slew_time Star3 Planet9) 1.752)
	(= (slew_time Planet9 Planet4) 48.1)
	(= (slew_time Planet4 Planet9) 48.1)
	(= (slew_time Planet9 Planet5) 27.36)
	(= (slew_time Planet5 Planet9) 27.36)
	(= (slew_time Planet9 Planet6) 5.454)
	(= (slew_time Planet6 Planet9) 5.454)
	(= (slew_time Planet9 Planet7) 57.71)
	(= (slew_time Planet7 Planet9) 57.71)
	(= (slew_time Planet9 Planet8) 54.87)
	(= (slew_time Planet8 Planet9) 54.87)
	(= (slew_time Star10 Star0) 52.69)
	(= (slew_time Star0 Star10) 52.69)
	(= (slew_time Star10 Star1) 14.75)
	(= (slew_time Star1 Star10) 14.75)
	(= (slew_time Star10 GroundStation2) 66.28)
	(= (slew_time GroundStation2 Star10) 66.28)
	(= (slew_time Star10 Star3) 25.31)
	(= (slew_time Star3 Star10) 25.31)
	(= (slew_time Star10 Planet4) 36.7)
	(= (slew_time Planet4 Star10) 36.7)
	(= (slew_time Star10 Planet5) 16.43)
	(= (slew_time Planet5 Star10) 16.43)
	(= (slew_time Star10 Planet6) 5.589)
	(= (slew_time Planet6 Star10) 5.589)
	(= (slew_time Star10 Planet7) 43.68)
	(= (slew_time Planet7 Star10) 43.68)
	(= (slew_time Star10 Planet8) 2.08)
	(= (slew_time Planet8 Star10) 2.08)
	(= (slew_time Star10 Planet9) 21.03)
	(= (slew_time Planet9 Star10) 21.03)
	(= (slew_time Star11 Star0) 6.259)
	(= (slew_time Star0 Star11) 6.259)
	(= (slew_time Star11 Star1) 7.686)
	(= (slew_time Star1 Star11) 7.686)
	(= (slew_time Star11 GroundStation2) 46.53)
	(= (slew_time GroundStation2 Star11) 46.53)
	(= (slew_time Star11 Star3) 0.5246)
	(= (slew_time Star3 Star11) 0.5246)
	(= (slew_time Star11 Planet4) 65.48)
	(= (slew_time Planet4 Star11) 65.48)
	(= (slew_time Star11 Planet5) 31.77)
	(= (slew_time Planet5 Star11) 31.77)
	(= (slew_time Star11 Planet6) 23.2)
	(= (slew_time Planet6 Star11) 23.2)
	(= (slew_time Star11 Planet7) 69.95)
	(= (slew_time Planet7 Star11) 69.95)
	(= (slew_time Star11 Planet8) 44.7)
	(= (slew_time Planet8 Star11) 44.7)
	(= (slew_time Star11 Planet9) 12.27)
	(= (slew_time Planet9 Star11) 12.27)
	(= (slew_time Star11 Star10) 6.852)
	(= (slew_time Star10 Star11) 6.852)
	(= (slew_time Phenomenon12 Star0) 18.2)
	(= (slew_time Star0 Phenomenon12) 18.2)
	(= (slew_time Phenomenon12 Star1) 50.95)
	(= (slew_time Star1 Phenomenon12) 50.95)
	(= (slew_time Phenomenon12 GroundStation2) 10.26)
	(= (slew_time GroundStation2 Phenomenon12) 10.26)
	(= (slew_time Phenomenon12 Star3) 77.82)
	(= (slew_time Star3 Phenomenon12) 77.82)
	(= (slew_time Phenomenon12 Planet4) 35.36)
	(= (slew_time Planet4 Phenomenon12) 35.36)
	(= (slew_time Phenomenon12 Planet5) 92.51)
	(= (slew_time Planet5 Phenomenon12) 92.51)
	(= (slew_time Phenomenon12 Planet6) 66.66)
	(= (slew_time Planet6 Phenomenon12) 66.66)
	(= (slew_time Phenomenon12 Planet7) 18.46)
	(= (slew_time Planet7 Phenomenon12) 18.46)
	(= (slew_time Phenomenon12 Planet8) 36.17)
	(= (slew_time Planet8 Phenomenon12) 36.17)
	(= (slew_time Phenomenon12 Planet9) 50.47)
	(= (slew_time Planet9 Phenomenon12) 50.47)
	(= (slew_time Phenomenon12 Star10) 37.61)
	(= (slew_time Star10 Phenomenon12) 37.61)
	(= (slew_time Phenomenon12 Star11) 52.21)
	(= (slew_time Star11 Phenomenon12) 52.21)
	(= (slew_time Phenomenon13 Star0) 73.47)
	(= (slew_time Star0 Phenomenon13) 73.47)
	(= (slew_time Phenomenon13 Star1) 46.96)
	(= (slew_time Star1 Phenomenon13) 46.96)
	(= (slew_time Phenomenon13 GroundStation2) 29.69)
	(= (slew_time GroundStation2 Phenomenon13) 29.69)
	(= (slew_time Phenomenon13 Star3) 24.37)
	(= (slew_time Star3 Phenomenon13) 24.37)
	(= (slew_time Phenomenon13 Planet4) 17.14)
	(= (slew_time Planet4 Phenomenon13) 17.14)
	(= (slew_time Phenomenon13 Planet5) 20.8)
	(= (slew_time Planet5 Phenomenon13) 20.8)
	(= (slew_time Phenomenon13 Planet6) 22.81)
	(= (slew_time Planet6 Phenomenon13) 22.81)
	(= (slew_time Phenomenon13 Planet7) 69.14)
	(= (slew_time Planet7 Phenomenon13) 69.14)
	(= (slew_time Phenomenon13 Planet8) 63.09)
	(= (slew_time Planet8 Phenomenon13) 63.09)
	(= (slew_time Phenomenon13 Planet9) 33.43)
	(= (slew_time Planet9 Phenomenon13) 33.43)
	(= (slew_time Phenomenon13 Star10) 18.35)
	(= (slew_time Star10 Phenomenon13) 18.35)
	(= (slew_time Phenomenon13 Star11) 51.83)
	(= (slew_time Star11 Phenomenon13) 51.83)
	(= (slew_time Phenomenon13 Phenomenon12) 0.7149)
	(= (slew_time Phenomenon12 Phenomenon13) 0.7149)
	(= (slew_time Star14 Star0) 0.6814)
	(= (slew_time Star0 Star14) 0.6814)
	(= (slew_time Star14 Star1) 8.576)
	(= (slew_time Star1 Star14) 8.576)
	(= (slew_time Star14 GroundStation2) 52.92)
	(= (slew_time GroundStation2 Star14) 52.92)
	(= (slew_time Star14 Star3) 0.3898)
	(= (slew_time Star3 Star14) 0.3898)
	(= (slew_time Star14 Planet4) 40.52)
	(= (slew_time Planet4 Star14) 40.52)
	(= (slew_time Star14 Planet5) 59.36)
	(= (slew_time Planet5 Star14) 59.36)
	(= (slew_time Star14 Planet6) 42.87)
	(= (slew_time Planet6 Star14) 42.87)
	(= (slew_time Star14 Planet7) 69.46)
	(= (slew_time Planet7 Star14) 69.46)
	(= (slew_time Star14 Planet8) 57.03)
	(= (slew_time Planet8 Star14) 57.03)
	(= (slew_time Star14 Planet9) 41.96)
	(= (slew_time Planet9 Star14) 41.96)
	(= (slew_time Star14 Star10) 13.6)
	(= (slew_time Star10 Star14) 13.6)
	(= (slew_time Star14 Star11) 29.22)
	(= (slew_time Star11 Star14) 29.22)
	(= (slew_time Star14 Phenomenon12) 64.13)
	(= (slew_time Phenomenon12 Star14) 64.13)
	(= (slew_time Star14 Phenomenon13) 29.67)
	(= (slew_time Phenomenon13 Star14) 29.67)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star10)
	(pointing satellite2 Star1)
	(pointing satellite4 Planet5)
	(have_image Star3 infrared2)
	(have_image Planet4 thermograph0)
	(have_image Planet5 thermograph0)
	(have_image Planet6 infrared2)
	(have_image Planet8 thermograph0)
	(have_image Planet9 image1)
	(have_image Star10 image1)
	(have_image Phenomenon12 infrared2)
	(have_image Phenomenon13 thermograph0)
	(have_image Star14 thermograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 planet9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet9)
   changed: (fuel satellite1) from 140 to 102.66, (fuel-used) from 0 to 37.34
   goals met: 1 of 13
2. (turn_to satellite3 phenomenon12 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 phenomenon12)
   changed: (fuel satellite3) from 114 to 49.87, (fuel-used) from 37.34 to 101.47
   goals met: 1 of 13
3. (turn_to satellite0 star10 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 165 to 128.3, (fuel-used) from 101.47 to 138.17
   goals met: 2 of 13
4. (turn_to satellite4 planet5 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 planet5)
   changed: (fuel satellite4) from 191 to 131.64, (fuel-used) from 138.17 to 197.53
   goals met: 3 of 13
5. (turn_to satellite1 star14 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star14)
   changed: (fuel satellite1) from 102.66 to 60.7, (fuel-used) from 197.53 to 239.49
   goals met: 3 of 13
6. (turn_to satellite3 groundstation2 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 groundstation2)
   changed: (fuel satellite3) from 49.87 to 39.61, (fuel-used) from 239.49 to 249.75
   goals met: 3 of 13
7. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 3 of 13
8. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 3 of 13
9. (calibrate satellite3 instrument7 groundstation2)
   added: (calibrated instrument7)
   goals met: 3 of 13
10. (turn_to satellite3 phenomenon13 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon13)
   changed: (fuel satellite3) from 39.61 to 9.92, (fuel-used) from 249.75 to 279.44
   goals met: 3 of 13
11. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   changed: (fuel satellite3) from 9.92 to 9.2051, (fuel-used) from 279.44 to 280.155
   goals met: 3 of 13
12. (turn_to satellite3 phenomenon13 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon13)
   changed: (fuel satellite3) from 9.2051 to 8.4902, (fuel-used) from 280.155 to 280.87
   goals met: 3 of 13
13. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   changed: (fuel satellite3) from 8.4902 to 7.7753, (fuel-used) from 280.87 to 281.585
   goals met: 3 of 13
14. (turn_to satellite3 phenomenon13 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon13)
   changed: (fuel satellite3) from 7.7753 to 7.0604, (fuel-used) from 281.585 to 282.3
   goals met: 3 of 13
15. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   changed: (fuel satellite3) from 7.0604 to 6.3455, (fuel-used) from 282.3 to 283.015
   goals met: 3 of 13
16. (turn_to satellite3 phenomenon13 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon13)
   changed: (fuel satellite3) from 6.3455 to 5.6306, (fuel-used) from 283.015 to 283.729
   goals met: 3 of 13
17. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   changed: (fuel satellite3) from 5.6306 to 4.9157, (fuel-used) from 283.729 to 284.444
   goals met: 3 of 13
18. (turn_to satellite3 phenomenon13 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon13)
   changed: (fuel satellite3) from 4.9157 to 4.2008, (fuel-used) from 284.444 to 285.159
   goals met: 3 of 13
19. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   changed: (fuel satellite3) from 4.2008 to 3.4859, (fuel-used) from 285.159 to 285.874
   goals met: 3 of 13
20. (take_image satellite3 phenomenon12 instrument7 infrared2)
   added: (have_image phenomenon12 infrared2)
   changed: (data_capacity satellite3) from 1000 to 763, (data-stored) from 0 to 237
   goals met: 4 of 13
21. (turn_to satellite3 phenomenon13 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon13)
   changed: (fuel satellite3) from 3.4859 to 2.771, (fuel-used) from 285.874 to 286.589
   goals met: 4 of 13
22. (turn_to satellite4 star0 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 star0)
   changed: (fuel satellite4) from 131.64 to 127.802, (fuel-used) from 286.589 to 290.427
   goals met: 3 of 13
23. (calibrate satellite4 instrument10 star0)
   added: (calibrated instrument10)
   goals met: 3 of 13
24. (turn_to satellite4 planet5 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 planet5)
   changed: (fuel satellite4) from 127.802 to 123.964, (fuel-used) from 290.427 to 294.265
   goals met: 4 of 13
25. (turn_to satellite1 star3 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 60.7 to 60.3102, (fuel-used) from 294.265 to 294.655
   goals met: 4 of 13
26. (turn_to satellite1 star14 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star14)
   changed: (fuel satellite1) from 60.3102 to 59.9204, (fuel-used) from 294.655 to 295.045
   goals met: 4 of 13
27. (take_image satellite4 planet5 instrument10 thermograph0)
   added: (have_image planet5 thermograph0)
   changed: (data_capacity satellite4) from 1000 to 897, (data-stored) from 237 to 340
   goals met: 5 of 13
28. (turn_to satellite1 star0 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 59.9204 to 59.239, (fuel-used) from 295.045 to 295.726
   goals met: 5 of 13
29. (turn_to satellite1 planet8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 59.239 to 56.052, (fuel-used) from 295.726 to 298.913
   goals met: 5 of 13
30. (turn_to satellite1 star0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 56.052 to 52.865, (fuel-used) from 298.913 to 302.1
   goals met: 5 of 13
31. (turn_to satellite1 planet8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 52.865 to 49.678, (fuel-used) from 302.1 to 305.287
   goals met: 5 of 13
32. (turn_to satellite1 star0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 49.678 to 46.491, (fuel-used) from 305.287 to 308.474
   goals met: 5 of 13
33. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 5 of 13
34. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 5 of 13
35. (turn_to satellite1 planet8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 46.491 to 43.304, (fuel-used) from 308.474 to 311.661
   goals met: 5 of 13
36. (take_image satellite3 phenomenon13 instrument7 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   changed: (data_capacity satellite3) from 763 to 524, (data-stored) from 340 to 579
   goals met: 6 of 13
37. (turn_to satellite1 star0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 43.304 to 40.117, (fuel-used) from 311.661 to 314.848
   goals met: 6 of 13
38. (turn_to satellite1 star14 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star14)
   changed: (fuel satellite1) from 40.117 to 39.4356, (fuel-used) from 314.848 to 315.529
   goals met: 6 of 13
39. (take_image satellite1 star14 instrument3 thermograph0)
   added: (have_image star14 thermograph0)
   changed: (data_capacity satellite1) from 1000 to 715, (data-stored) from 579 to 864
   goals met: 7 of 13
40. (turn_to satellite1 star0 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 39.4356 to 38.7542, (fuel-used) from 315.529 to 316.211
   goals met: 7 of 13
41. (turn_to satellite1 planet8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 38.7542 to 35.5672, (fuel-used) from 316.211 to 319.398
   goals met: 7 of 13
42. (take_image satellite1 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   changed: (data_capacity satellite1) from 715 to 673, (data-stored) from 864 to 906
   goals met: 8 of 13
43. (turn_to satellite1 planet4 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 35.5672 to 21.4072, (fuel-used) from 319.398 to 333.558
   goals met: 8 of 13
44. (take_image satellite1 planet4 instrument3 thermograph0)
   added: (have_image planet4 thermograph0)
   changed: (data_capacity satellite1) from 673 to 615, (data-stored) from 906 to 964
   goals met: 9 of 13
45. (turn_to satellite1 planet6 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 21.4072 to 17.8192, (fuel-used) from 333.558 to 337.146
   goals met: 9 of 13
46. (take_image satellite1 planet6 instrument3 infrared2)
   added: (have_image planet6 infrared2)
   changed: (data_capacity satellite1) from 615 to 418, (data-stored) from 964 to 1161
   goals met: 10 of 13
47. (turn_to satellite1 planet9 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet9)
   changed: (fuel satellite1) from 17.8192 to 12.3652, (fuel-used) from 337.146 to 342.6
   goals met: 10 of 13
48. (take_image satellite1 planet9 instrument3 image1)
   added: (have_image planet9 image1)
   changed: (data_capacity satellite1) from 418 to 301, (data-stored) from 1161 to 1278
   goals met: 11 of 13
49. (turn_to satellite1 star3 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 12.3652 to 10.6132, (fuel-used) from 342.6 to 344.352
   goals met: 11 of 13
50. (turn_to satellite1 star14 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star14)
   changed: (fuel satellite1) from 10.6132 to 10.2234, (fuel-used) from 344.352 to 344.742
   goals met: 11 of 13
51. (turn_to satellite1 star0 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 10.2234 to 9.542, (fuel-used) from 344.742 to 345.423
   goals met: 11 of 13
52. (turn_to satellite1 planet8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 9.542 to 6.355, (fuel-used) from 345.423 to 348.61
   goals met: 11 of 13
53. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   changed: (fuel satellite1) from 6.355 to 4.275, (fuel-used) from 348.61 to 350.69
   goals met: 11 of 13
54. (take_image satellite1 star10 instrument3 image1)
   added: (have_image star10 image1)
   changed: (data_capacity satellite1) from 301 to 149, (data-stored) from 1278 to 1430
   goals met: 12 of 13
55. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 12 of 13
56. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 12 of 13
57. (turn_to satellite2 star3 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 167 to 122.2, (fuel-used) from 350.69 to 395.49
   goals met: 11 of 13
58. (take_image satellite2 star3 instrument6 infrared2)
   added: (have_image star3 infrared2)
   changed: (data_capacity satellite2) from 1000 to 957, (data-stored) from 1430 to 1473
   goals met: 12 of 13
59. (turn_to satellite2 star1 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 122.2 to 77.4, (fuel-used) from 395.49 to 440.29
   goals met: 13 of 13
